       IDENTIFICATION DIVISION.
       PROGRAM-ID. INFO-ABOUT-ME.

       PROCEDURE DIVISION.
           DISPLAY "NAME: RANJEEV".
           DISPLAY "I AM FROM TRINIDAD AND TOBAGO".
           DISPLAY "I AM LEARNING COBOL".
           STOP RUN.
