       IDENTIFICATION DIVISION.
       PROGRAM-ID. MY-FIRST-PROGRAM.

       PROCEDURE DIVISION.
           DISPLAY "HELLO WORLD".
           STOP RUN.
