       IDENTIFICATION DIVISION.
       PROGRAM-ID. MY-INTRODUCTION-PROGRAM.

       PROCEDURE DIVISION.
           DISPLAY "MY NAME IS RANJEEV".
           DISPLAY "I AM LEARNING COBOL".
           STOP RUN.
