       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARITHMETIC-OPERATIONS.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 WS-A       PIC 99.
       01 WS-B       PIC 99.
       01 WS-RESULT  PIC 999.

       PROCEDURE DIVISION.

           MOVE 10 TO WS-A.
           MOVE 5 TO WS-B.

           ADD WS-A TO WS-B GIVING WS-RESULT.
           DISPLAY "ADDITION RESULT: " WS-RESULT.

           SUBTRACT WS-B FROM WS-A GIVING WS-RESULT.
           DISPLAY "SUBTRACTION RESULT: " WS-RESULT.

           MULTIPLY WS-A BY WS-B GIVING WS-RESULT.
           DISPLAY "MULTIPLICATION RESULT: " WS-RESULT.

           DIVIDE WS-B INTO WS-A GIVING WS-RESULT.
           DISPLAY "DIVISION RESULT: " WS-RESULT.

           STOP RUN.
