       IDENTIFICATION DIVISION.
       PROGRAM-ID. BANK-CUSTOMER.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 WS-CUS-NAME    PIC X(35).
       01 WS-CUS-AGE     PIC 99.
       01 WS-CUS-ACC-NUM PIC X(20).

       PROCEDURE DIVISION.
           MOVE "RANJEEV" TO WS-CUS-NAME.
           MOVE 30 TO WS-CUS-AGE.
           MOVE "AC#123456" TO WS-CUS-ACC-NUM.
           DISPLAY "NAME: " WS-CUS-NAME.
           DISPLAY "AGE: " WS-CUS-AGE.
           DISPLAY "ACCOUNT NUMBER: " WS-CUS-ACC-NUM.
           STOP RUN.
