       IDENTIFICATION DIVISION.
       PROGRAM-ID. EMPLOYEE-INFO.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 WS-EMP-NAME     PIC X(35).
       01 WS-EMP-AGE      PIC 99.
       01 WS-EMP-JOB-TITLE PIC X(100).

       PROCEDURE DIVISION.
           MOVE "RANJEEV" TO WS-EMP-NAME.
           MOVE 30 TO WS-EMP-AGE.
           MOVE "E & I TECHNICIAN" TO WS-EMP-JOB-TITLE.
           DISPLAY "EMPLOYEE NAME: " WS-EMP-NAME.
           DISPLAY "AGE: " WS-EMP-AGE.
           DISPLAY "JOB TITLE: " WS-EMP-JOB-TITLE.
           STOP RUN.
