       IDENTIFICATION DIVISION.
       PROGRAM-ID. EMPLOYEE-REGISTRATION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 WS-EMP-NAME       PIC X(35).
       01 WS-EMP-AGE        PIC 99.
       01 WS-EMP-JOB-TITLE  PIC X(40).
       01 WS-EMP-NUMBER     PIC X(15).

       PROCEDURE DIVISION.

           DISPLAY "PLEASE ENTER EMPLOYEE NAME: ".
           ACCEPT WS-EMP-NAME.

           DISPLAY "PLEASE ENTER EMPLOYEE AGE: ".
           ACCEPT WS-EMP-AGE.

           DISPLAY "PLEASE ENTER EMPLOYEE JOB TITLE: ".
           ACCEPT WS-EMP-JOB-TITLE.

           DISPLAY "PLEASE ENTER EMPLOYEE NUMBER: ".
           ACCEPT WS-EMP-NUMBER.

           DISPLAY "----- EMPLOYEE INFORMATION -----".
           DISPLAY "EMPLOYEE NAME: " WS-EMP-NAME.
           DISPLAY "AGE: " WS-EMP-AGE.
           DISPLAY "JOB TITLE: " WS-EMP-JOB-TITLE.
           DISPLAY "EMPLOYEE NO: " WS-EMP-NUMBER.

           STOP RUN.
